<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da16_datetime.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


* Python `datetime` 모듈
    * `datetime` 클래스: 날짜(date), 시간(time)과 관련된 정보들을 저장, 표현할 수 있는 기능(메서드)들을 가지고 있는 데이터 타입.
    * https://docs.python.org/3/library/datetime.html 참고

In [1]:
import datetime  # datetime 모듈을 import

In [2]:
datetime.datetime.now()  #> Colab 가상 머신의 현재 시간을 리턴함.
# datetime 모듈에 있는 datetime 클래스에 있는 now() 메서드 호출

datetime.datetime(2021, 8, 19, 0, 42, 42, 426655)

In [3]:
from datetime import datetime  # datetime 모듈에서 datetime 클래스를 import

In [4]:
datetime.now()
# datetime 클래스의 now() 메서드 호출

datetime.datetime(2021, 8, 19, 0, 42, 42, 455469)


* `datetime` 클래스의 메서드

In [5]:
# datetime.now(): 코드가 실행되는 컴퓨터 OS에서 설정된 시간대의 현재 시간을 리턴
curr_dt = datetime.now()

In [6]:
curr_dt  # expression을 출력

datetime.datetime(2021, 8, 19, 0, 42, 42, 471568)

In [7]:
print(curr_dt)  # statement

2021-08-19 00:42:42.471568


* UTC(Coordinates Universal Timezone): 그리니치 천문대 기준 시간
* KST(Korean Standard Timezone): 한국표준시. UTC+09:00

In [8]:
# datetime.datetime 클래스의 속성들: year, month, day, hour, minute, second
print(type(curr_dt))
print(curr_dt.year)
print(curr_dt.month)
print(curr_dt.day)
print(f'{curr_dt.hour}:{curr_dt.minute}:{curr_dt.second}')

<class 'datetime.datetime'>
2021
8
19
0:42:42

In [9]:
# datetime.datetime() 생성자 함수
yesterday = datetime(2021, 8, 17)
print(yesterday)

2021-08-17 00:00:00

In [10]:
tomorrow = datetime(2021, 8, 19, 17, 20)
print(tomorrow)

2021-08-19 17:20:00

In [11]:
tomorrow - yesterday  # datetime 타입의 변수들의 뺄셈 결과는 timedelta 클래스 타입

datetime.timedelta(days=2, seconds=62400)


* `datetime`(날짜/시간) 객체 <---> `str`(문자열) 객체
    * `datetime.strftime(포맷문자열)`: `datetime` 객체를 포맷문자열 형식으로 formatting된 문자열로 변환해서 리턴.
    * `datetime.strptime(문자열, 포맷문자열)`: 문자열(str)을 `datetime` 객체로 변환(parsing).

* 날짜 포맷 문자열
    * 연(year): `%Y`(4자리 연도), `%y`(2자리 연도)
    * 월(month): `%m`(2자리 숫자), `%B`(월 이름), `%b`(월 이름 약자)
    * 일(day): `%d`(2자리 숫자)
    * 시(hour): `%H`(24시간 형식. 0 ~ 23), `%I`(12시간 형식. 1 ~ 12)
    * 분(minute): `%M`(2자리 숫자. 00 ~ 59)
    * 초(second): `%S`(2자리 숫자. 00 ~ 59)

In [12]:
curr_dt = datetime.now()
print(curr_dt)

2021-08-19 00:42:42.581514

`datetime` 객체 ---> `str`

In [13]:
curr_dt.strftime('%Y/%m/%d')  #> argument로 전달된 포맷으로 formatting된 문자열을 리턴.

'2021/08/19'

In [14]:
curr_dt.strftime('%b-%d-%y')

'Aug-19-21'

In [15]:
curr_dt.strftime('%I:%M:%S %p')  # %p: AM/PM(오전/오후) 표시

'12:42:42 AM'

`str` ---> `datetime` 객체

In [16]:
# datetime.strptime(string, format): format 형식의 문자열 string을 datetime 객체로 변환(parsing) 리턴.
datetime.strptime('2021-08-18 18:04:30', '%Y-%m-%d %H:%M:%S')

datetime.datetime(2021, 8, 18, 18, 4, 30)

In [17]:
datetime.strptime('08-18-21', '%m-%d-%y')

datetime.datetime(2021, 8, 18, 0, 0)

In [18]:
datetime.strptime('18-08-21', '%y-%m-%d')  # 우리나라 방식(년-월-일)

datetime.datetime(2018, 8, 21, 0, 0)

In [19]:
datetime.strptime('18-08-21', '%d-%m-%y')  # 영국 방식(일-월-년)

datetime.datetime(2021, 8, 18, 0, 0)

* timestamp(UNIX time, POSIX time, epoch time, ...): 1970년 1월 1일 0시 0분 0초를 시작으로 해서 1초마다 1씩 증가하는 숫자.
* `datetime.timestamp` 메서드: `datetime` 객체 ---> `timestamp`(숫자)
* `datetime.fromtimestamp` 메서드: `timestamp`(숫자) ---> `datetime` 객체

In [20]:
curr_dt = datetime.now()
print(curr_dt)

2021-08-19 00:54:40.563941

In [21]:
ts = curr_dt.timestamp()
print(ts)
print(type(ts))

1629334480.563941
<class 'float'>

In [22]:
dt = datetime.fromtimestamp(1629334480)
print(dt)
print(type(dt))

2021-08-19 00:54:40
<class 'datetime.datetime'>

In [23]:
ratings_file = 'https://github.com/wesm/pydata-book/raw/2nd-edition/datasets/movielens/ratings.dat'

In [24]:
import pandas as pd

In [25]:
ratings = pd.read_csv(ratings_file, sep='::', engine='python',
                      names=['user_id', 'movie_id', 'rating', 'ts'],
                      nrows=10)  # 파일에서 10개 행만 읽음

In [26]:
ratings

   user_id  movie_id  rating         ts
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291
5        1      1197       3  978302268
6        1      1287       5  978302039
7        1      2804       5  978300719
8        1       594       4  978302268
9        1       919       4  978301368

In [34]:
dates = []  # ratings 데이터프레임의 ts 값(timestamp)을 datetime 객체로 변환한 값들을 저장하기 위한 리스트
for ts in ratings['ts']:  # ts 컬럼의 값들을 처음부터 끝까지 반복하면서
    dates.append(datetime.fromtimestamp(ts))  # 숫자를 datetime으로 변환 후 리스트에 추가

print(dates)
print(pd.Series(dates))

# dates에 저장된 값들을 파생변수로 데이터프레임에 추가
ratings['dt'] = pd.Series(dates)

[datetime.datetime(2000, 12, 31, 22, 12, 40), datetime.datetime(2000, 12, 31, 22, 35, 9), datetime.datetime(2000, 12, 31, 22, 32, 48), datetime.datetime(2000, 12, 31, 22, 4, 35), datetime.datetime(2001, 1, 6, 23, 38, 11), datetime.datetime(2000, 12, 31, 22, 37, 48), datetime.datetime(2000, 12, 31, 22, 33, 59), datetime.datetime(2000, 12, 31, 22, 11, 59), datetime.datetime(2000, 12, 31, 22, 37, 48), datetime.datetime(2000, 12, 31, 22, 22, 48)]
0   2000-12-31 22:12:40
1   2000-12-31 22:35:09
2   2000-12-31 22:32:48
3   2000-12-31 22:04:35
4   2001-01-06 23:38:11
5   2000-12-31 22:37:48
6   2000-12-31 22:33:59
7   2000-12-31 22:11:59
8   2000-12-31 22:37:48
9   2000-12-31 22:22:48
dtype: datetime64[ns]

In [32]:
ratings

   user_id  movie_id  rating         ts                  dt
0        1      1193       5  978300760 2000-12-31 22:12:40
1        1       661       3  978302109 2000-12-31 22:35:09
2        1       914       3  978301968 2000-12-31 22:32:48
3        1      3408       4  978300275 2000-12-31 22:04:35
4        1      2355       5  978824291 2001-01-06 23:38:11
5        1      1197       3  978302268 2000-12-31 22:37:48
6        1      1287       5  978302039 2000-12-31 22:33:59
7        1      2804       5  978300719 2000-12-31 22:11:59
8        1       594       4  978302268 2000-12-31 22:37:48
9        1       919       4  978301368 2000-12-31 22:22:48

In [35]:
# pd.to_datetime() 함수: 문자열 Series 또는 숫자 Series를 datetime Series로 변환
ratings['dt2'] = pd.to_datetime(ratings['ts'], unit='s')
#> unit: timestamp(숫자)가 저장하고 있는 시간의 단위
# s: 초(second), ms: milli-second, us: micro-second, ns: nano-second
ratings

   user_id  movie_id  rating         ts                  dt                 dt2
0        1      1193       5  978300760 2000-12-31 22:12:40 2000-12-31 22:12:40
1        1       661       3  978302109 2000-12-31 22:35:09 2000-12-31 22:35:09
2        1       914       3  978301968 2000-12-31 22:32:48 2000-12-31 22:32:48
3        1      3408       4  978300275 2000-12-31 22:04:35 2000-12-31 22:04:35
4        1      2355       5  978824291 2001-01-06 23:38:11 2001-01-06 23:38:11
5        1      1197       3  978302268 2000-12-31 22:37:48 2000-12-31 22:37:48
6        1      1287       5  978302039 2000-12-31 22:33:59 2000-12-31 22:33:59
7        1      2804       5  978300719 2000-12-31 22:11:59 2000-12-31 22:11:59
8        1       594       4  978302268 2000-12-31 22:37:48 2000-12-31 22:37:48
9        1       919       4  978301368 2000-12-31 22:22:48 2000-12-31 22:22:48